# Cross-platform make
#brew "cmake"

# Distributed revision control system
brew "git"

# Enable transparent encryption/decryption of files in a git repo
#brew "git-crypt"

# GNU Transport Layer Security (TLS) Library
brew "gnutls"

# GNU Pretty Good Privacy (PGP) package
brew "gnupg"

# Image manipulation library
brew "jpeg"

# Lightweight and flexible command-line JSON processor
brew "jq"

# Mac App Store command-line interface
brew "mas"

# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"

# Display directories as trees (with optional color/HTML output)
brew "tree"

# Internet file retriever
brew "wget"

# A general-purpose command-line fuzzy finder
brew "fzf"

# A simple, fast and user-friendly alternative to 'find'
brew "fd"

# A viewer for git and diff output
brew "git-delta"

# A cat(1) clone with wings
brew "bat"

# A command-line tool that makes git easier to use with GitHub
brew "gh"

# A command-line fuzzy finder (it is like awk, but faster). 
# eg.: ag 'search_string' file_name
brew "the_silver_searcher"

# On-chip debugging, in-system programming and boundary-scan testing
#brew "open-ocd"

# Package manager for the Lua programming language
#brew "luarocks"

# a line-oriented search tool that recursively searches the current directory for a regex pattern
brew "ripgrep"

brew "rectangle"

# Application uninstaller
cask "appcleaner"

# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"

# File archiver
cask "keka"

# Open-source BitTorrent client
#cask "transmission"

# Open-source code editor
cask "visual-studio-code"

# Multimedia player
cask "vlc"

# Pre-built GNU bare-metal toolchain for 32-bit Arm processors
cask "gcc-arm-embedded"

# Ghostty is a fast, feature-rich, and cross-platform terminal emulator that uses platform-native UI and GPU acceleration.
cask "ghostty"

# Apple App Store 
mas "Be Focused Pro", id: 961632517
mas "Xcode", id: 497799835
mas "Dropzone 4 - Enhance Workflow", id: 1485052491
# mas "Amphetamine", id: 937984704 # keeps mac awake
